{"weightsManifest": [{"weights": [{"shape": [3, 32, 128], "dtype": "float32", "name": "convs/kernel"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [20000, 32], "dtype": "float32", "name": "embeddings/embeddings"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [1, 128, 1], "dtype": "float32", "name": "word_preds/kernel"}, {"shape": [1], "dtype": "float32", "name": "word_preds/bias"}], "paths": ["group3-shard1of1"]}], "modelTopology": {"keras_version": "2.1.5-tf", "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "loss_weights": null, "loss": "mse", "optimizer_config": {"class_name": "SGD", "config": {"lr": 0.009999999776482582, "nesterov": false, "momentum": 0.0, "decay": 0.0}}, "metrics": []}, "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, null], "name": "input_1"}, "name": "input_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"mask_zero": false, "trainable": true, "batch_input_shape": [null, null], "input_length": null, "embeddings_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}}, "activity_regularizer": null, "dtype": "float32", "name": "embeddings", "input_dim": 20000, "embeddings_constraint": null, "output_dim": 32, "embeddings_regularizer": null}, "name": "embeddings"}, {"class_name": "Conv1D", "inbound_nodes": [[["embeddings", 0, 0, {}]]], "config": {"use_bias": false, "trainable": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3], "dilation_rate": [1], "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.05, "mean": 0.0, "dtype": "float32", "seed": null}}, "bias_constraint": null, "dtype": "float32", "name": "convs", "activation": "linear", "filters": 128, "kernel_regularizer": null, "strides": [1], "kernel_constraint": null}, "name": "convs"}, {"class_name": "Conv1D", "inbound_nodes": [[["convs", 0, 0, {}]]], "config": {"use_bias": true, "trainable": true, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [1], "dilation_rate": [1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "dtype": "float32", "name": "word_preds", "activation": "linear", "filters": 1, "kernel_regularizer": null, "strides": [1], "kernel_constraint": null}, "name": "word_preds"}], "output_layers": [["word_preds", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}}}