{"modelTopology": {"keras_version": "2.1.5-tf", "training_config": {"loss": "mse", "metrics": [], "optimizer_config": {"class_name": "SGD", "config": {"lr": 0.009999999776482582, "momentum": 0.0, "decay": 0.0, "nesterov": false}}, "sample_weight_mode": null, "loss_weights": null}, "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, null], "sparse": false, "dtype": "float32"}, "name": "input_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null, "dtype": "float32"}}, "input_dim": 20000, "trainable": true, "input_length": null, "output_dim": 32, "dtype": "float32", "activity_regularizer": null, "embeddings_constraint": null, "name": "embeddings", "mask_zero": false, "batch_input_shape": [null, null], "embeddings_regularizer": null}, "name": "embeddings"}, {"class_name": "Conv1D", "inbound_nodes": [[["embeddings", 0, 0, {}]]], "config": {"dilation_rate": [1], "kernel_size": [3], "padding": "same", "trainable": true, "dtype": "float32", "use_bias": false, "activity_regularizer": null, "name": "convs", "activation": "relu", "bias_constraint": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [1], "filters": 128, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "name": "convs"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convs", 0, 0, {}]]], "config": {"beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "name": "batch_normalization_1", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_constraint": null, "epsilon": 0.001, "center": true, "axis": [2]}, "name": "batch_normalization_1"}, {"class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"dilation_rate": [1], "kernel_size": [1], "padding": "valid", "trainable": true, "dtype": "float32", "use_bias": true, "activity_regularizer": null, "name": "word_preds", "activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "strides": [1], "filters": 1, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "name": "word_preds"}], "output_layers": [["word_preds", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [128], "name": "batch_normalization_1/gamma", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_1/beta", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_1/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_1/moving_variance", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [3, 32, 128], "name": "convs/kernel", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [20000, 32], "name": "embeddings/embeddings", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [1, 128, 1], "name": "word_preds/kernel", "dtype": "float32"}, {"shape": [1], "name": "word_preds/bias", "dtype": "float32"}]}]}