{"modelTopology": {"backend": "tensorflow", "training_config": {"loss": "mse", "metrics": [], "optimizer_config": {"config": {"decay": 0.0, "nesterov": false, "lr": 0.009999999776482582, "momentum": 0.0}, "class_name": "SGD"}, "sample_weight_mode": null, "loss_weights": null}, "model_config": {"config": {"output_layers": [["word_preds", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null], "name": "input_1"}, "name": "input_1"}, {"class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "trainable": true, "input_dim": 20000, "name": "embeddings", "input_length": null, "dtype": "float32", "output_dim": 32, "embeddings_constraint": null, "mask_zero": false, "batch_input_shape": [null, null], "embeddings_regularizer": null, "embeddings_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}, "class_name": "RandomNormal"}}, "name": "embeddings"}, {"class_name": "Conv1D", "inbound_nodes": [[["embeddings", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "padding": "same", "name": "convs", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": false, "filters": 128, "kernel_size": [3], "dilation_rate": [1], "trainable": true, "strides": [1], "kernel_initializer": {"config": {"mean": 0.0, "stddev": 0.05, "dtype": "float32", "seed": null}, "class_name": "RandomNormal"}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null}, "name": "convs"}, {"class_name": "Conv1D", "inbound_nodes": [[["convs", 0, 0, {}]]], "config": {"activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "padding": "valid", "name": "word_preds", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "use_bias": true, "filters": 1, "kernel_size": [1], "dilation_rate": [1], "trainable": true, "strides": [1], "kernel_initializer": {"config": {"seed": null, "dtype": "float32", "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null}, "name": "word_preds"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}, "keras_version": "2.1.5-tf"}, "weightsManifest": [{"weights": [{"dtype": "float32", "shape": [3, 32, 128], "name": "convs/kernel"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [20000, 32], "name": "embeddings/embeddings"}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [1, 128, 1], "name": "word_preds/kernel"}, {"dtype": "float32", "shape": [1], "name": "word_preds/bias"}], "paths": ["group3-shard1of1"]}]}