{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "Embedding", "config": {"trainable": false, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "orthogonal", "input_dtype": "int32", "mask_zero": false, "input_dim": 123, "batch_input_shape": [null, 30], "W_regularizer": null, "dropout": 0.0, "output_dim": 123, "input_length": 30}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "GRU", "config": {"U_regularizer": null, "name": "forward_gru_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 512, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 123, "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "activation": "tanh", "input_length": null}}, "trainable": true, "name": "bidirectional_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 50}}, {"class_name": "Activation", "config": {"activation": "tanh", "trainable": true, "name": "activation_1"}}]}